---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.StairsBaseOffset
source: html/c33dad87-74b3-b727-001f-a1e4c72040d8.htm
---
# Autodesk.Revit.DB.ParameterTypeId.StairsBaseOffset Property

"Base Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId StairsBaseOffset { get; }
```